epyc/20240121-1127-jemalloc/1-locks/32768/pgbench-warmup-1000-1000.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 1000
partition method: range
partitions: 1000
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 41473255
number of failed transactions: 0 (0.000%)
latency average = 0.046 ms
initial connection time = 61.200 ms
tps = 691918.520451 (without initial connection time)